In [1]:
import pandas as pd

file="purchase_data.json"
file_json=pd.read_json(file)
file_json_sort=file_json.sort_values("SN")

file_json.head()

,Age,Gender,Item ID,Item Name,Price,SN
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46
2,34,Male,174,Primitive Blade,2.46,Assastnya25
3,21,Male,92,Final Critic,1.36,Pheusrical25
4,23,Male,63,Stormfury Mace,1.27,Aela59

In [2]:

agg=file_json_sort.groupby('Gender').SN.nunique()
agg

Gender
Female                   100
Male                     465
Other / Non-Disclosed      8
Name: SN, dtype: int64

In [3]:
bins=[0,9,14,19,24,29,34,39,100]
#create group labels for the bins
group_lables=["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]

In [4]:
sor_item=file_json_sort.groupby(['Item ID','Item Name'])
purchase_count_item=sor_item['Age'].count()
purchase_count_item.head()

Item ID  Item Name
0        Splinter              1
1        Crucifer              4
2        Verdict               1
3        Phantomlight          1
4        Bloodlord's Fetish    1
Name: Age, dtype: int64

In [5]:
#total purchase price
oitem_price=sor_item['Price'].sum()
oitem_price.head()

Item ID  Item Name
0        Splinter              1.82
1        Crucifer              9.12
2        Verdict               3.40
3        Phantomlight          1.79
4        Bloodlord's Fetish    2.28
Name: Price, dtype: float64

In [6]:
new_item_pur_table=pd.DataFrame({"Purchase count":purchase_count_item,
                                  "Total Purchase Value":oitem_price})
new_item_pur_table.head()

                            Purchase count  Total Purchase Value
Item ID Item Name
0       Splinter                         1                  1.82
1       Crucifer                         4                  9.12
2       Verdict                          1                  3.40
3       Phantomlight                     1                  1.79
4       Bloodlord's Fetish               1                  2.28

In [7]:
#Most popular item
new_item_pur_table["Item Price"]=new_item_pur_table['Total Purchase Value']/new_item_pur_table['Purchase count']
Most_pul_item=new_item_pur_table.sort_values(by='Purchase count',ascending=False)
Most_pul_item.head()

,,Purchase count,Total Purchase Value,Item Price
Item ID,Item Name,,,
39,"Betrayal, Whisper of Grieving Widows",11,25.85,2.35
84,Arcane Gem,11,24.53,2.23
31,Trickster,9,18.63,2.07
175,Woeful Adamantite Claymore,9,11.16,1.24
13,Serenity,9,13.41,1.49

In [8]:
#Most PROFIT ITEM
Most_prof_item=new_item_pur_table.sort_values(by="Total Purchase Value",ascending=False)
Most_prof_item.head()

,,Purchase count,Total Purchase Value,Item Price
Item ID,Item Name,,,
34,Retribution Axe,9,37.26,4.14
115,Spectral Diamond Doomblade,7,29.75,4.25
32,Orenmir,6,29.70,4.95
103,Singed Scalpel,6,29.22,4.87
107,"Splitter, Foe Of Subtlety",8,28.88,3.61

In [9]:
item_price=file_json_sort[['Item ID','Item Name','Price']]
item_price.head()

     Item ID              Item Name  Price
144       44  Bonecarvin Battle Axe   2.46
308       79    Alpha, Oath of Zeal   2.88
377      174        Primitive Blade   2.46
431       92           Final Critic   1.36
224      106    Crying Steel Sickle   2.29

In [10]:
file_json_sort['Age Range']=pd.cut(file_json_sort['Age'],bins,labels=group_lables)
file_json_sort.head()

     Age Gender  Item ID              Item Name  Price            SN Age Range
144   20   Male       44  Bonecarvin Battle Axe   2.46  Adairialis76     20-24
308   37   Male       79    Alpha, Oath of Zeal   2.88    Aduephos78     35-39
377   37   Male      174        Primitive Blade   2.46    Aduephos78     35-39
431   37   Male       92           Final Critic   1.36    Aduephos78     35-39
224   26   Male      106    Crying Steel Sickle   2.29     Aeduera68     25-29

In [11]:
age_total_count=file_json_sort.groupby('Age Range').SN.nunique()
age_total_count

Age Range
<10       19
10-14     23
15-19    100
20-24    259
25-29     87
30-34     47
35-39     27
40+       11
Name: SN, dtype: int64

In [12]:
nor_avg_age_price=file_json_sort.groupby('Age Range')
nor_price=nor_avg_age_price['Price']

In [13]:
purchase_count=file_json_sort.groupby('Age Range')
pur_count=purchase_count['Age'].count()
pur_count

Age Range
<10       28
10-14     35
15-19    133
20-24    336
25-29    125
30-34     64
35-39     42
40+       17
Name: Age, dtype: int64

In [14]:
total_pur_val=(purchase_count['Age'].count()*(purchase_count['Price'].mean())).map("${:.2f}".format)
total_pur_val

Age Range
<10       $83.46
10-14     $96.95
15-19    $386.42
20-24    $978.77
25-29    $370.33
30-34    $197.25
35-39    $119.40
40+       $53.75
dtype: object

In [15]:
avg_pur_price=(purchase_count['Price'].mean()).map("${:.2f}".format)
avg_pur_price

Age Range
<10      $2.98
10-14    $2.77
15-19    $2.91
20-24    $2.91
25-29    $2.96
30-34    $3.08
35-39    $2.84
40+      $3.16
Name: Price, dtype: object

In [16]:
total_player=file_json_sort.groupby('Age Range').SN.nunique().sum()
player_per_age=((file_json_sort.groupby('Age Range').SN.nunique()/total_player)*100).map("{:.2f}".format)
player_per_age

Age Range
<10       3.32
10-14     4.01
15-19    17.45
20-24    45.20
25-29    15.18
30-34     8.20
35-39     4.71
40+       1.92
Name: SN, dtype: object

In [17]:
Age_Demo=pd.DataFrame({"Percentage of Players":player_per_age,
                       "Total Count":age_total_count})
Age_Demo

          Percentage of Players  Total Count
Age Range
<10                        3.32           19
10-14                      4.01           23
15-19                     17.45          100
20-24                     45.20          259
25-29                     15.18           87
30-34                      8.20           47
35-39                      4.71           27
40+                        1.92           11

In [18]:

total=file_json_sort.groupby('Gender').SN.nunique().sum()
total

573

In [19]:
user_count=file_json_sort["SN"].unique()
#print(len(user_count))
total_user_count=len(user_count)
total_user_count
#user_count.shape

573

In [20]:
per_centage=round((file_json_sort.groupby('Gender').SN.nunique()/total)*100,2)
per_centage

Gender
Female                   17.45
Male                     81.15
Other / Non-Disclosed     1.40
Name: SN, dtype: float64

In [21]:
Gender_Dem=pd.DataFrame({"Percentage of Players":per_centage,
                          "Total Count":agg})
Gender_Dem

                       Percentage of Players  Total Count
Gender
Female                                 17.45          100
Male                                   81.15          465
Other / Non-Disclosed                   1.40            8

In [22]:
gender_count=file_json_sort["Gender"].value_counts()
gender_count

Male                     633
Female                   136
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [23]:
group_by_gender=file_json_sort.groupby(['Gender'])
group_by_gender.count()

                       Age  Item ID  Item Name  Price   SN  Age Range
Gender
Female                 136      136        136    136  136        136
Male                   633      633        633    633  633        633
Other / Non-Disclosed   11       11         11     11   11         11

In [24]:
avg_price=group_by_gender["Price"].mean()
avg=avg_price.map("${:.2f}".format)
avg

Gender
Female                   $2.82
Male                     $2.95
Other / Non-Disclosed    $3.25
Name: Price, dtype: object

In [25]:
group_by_age=file_json_sort.groupby(['Age Range'])
no_total=(group_by_age["Price"].sum()/file_json_sort.groupby('Age Range').SN.nunique()).map("${:.2f}".format)
no_total

Age Range
<10      $4.39
10-14    $4.22
15-19    $3.86
20-24    $3.78
25-29    $4.26
30-34    $4.20
35-39    $4.42
40+      $4.89
dtype: object

In [26]:
#Purchase Analysing(age)
Pur_age_table=pd.DataFrame({"Purchase Count":pur_count,
                             "Average Purchase Price":avg_pur_price,
                            "Total Purchase Value":total_pur_val,
                            "Normalized Totals":no_total})
Pur_age_table

,Average Purchase Price,Normalized Totals,Purchase Count,Total Purchase Value
Age Range,,,,
<10,$2.98,$4.39,28,$83.46
10-14,$2.77,$4.22,35,$96.95
15-19,$2.91,$3.86,133,$386.42
20-24,$2.91,$3.78,336,$978.77
25-29,$2.96,$4.26,125,$370.33
30-34,$3.08,$4.20,64,$197.25
35-39,$2.84,$4.42,42,$119.40
40+,$3.16,$4.89,17,$53.75

In [27]:
sor_sn_price=file_json_sort.groupby(['SN']).sum()
max_price_total=sor_sn_price.sort_values(by="Price" , ascending=False)

total_purchase_value=(max_price_total['Price']).map("${:.2f}".format)
total_purchase_value.head()

SN
Undirrala66    $17.06
Saedue76       $13.56
Mindimnya67    $12.74
Haellysu29     $12.73
Eoda93         $11.58
Name: Price, dtype: object

In [28]:
#Top Spender group by SN
file_json_sn=file_json_sort.groupby(['SN']).count()
top_5_spend=file_json_sn.sort_values(by='Age' ,ascending=False)
purchase_count=top_5_spend['Age']
purchase_count.head()

SN
Undirrala66    5
Mindimnya67    4
Qarwen67       4
Saedue76       4
Sondastan54    4
Name: Age, dtype: int64

In [29]:
top_spender=pd.DataFrame({"Purchase Count":purchase_count,
                          "Total Purchase Value":total_purchase_value})
top_spender.head()

              Purchase Count Total Purchase Value
Adairialis76               1                $2.46
Aduephos78                 3                $6.70
Aeduera68                  3                $5.80
Aela49                     1                $2.46
Aela59                     1                $1.27

In [30]:
#df[['Currency']] = df[['Currency']].replace('[\$,]','',regex=True).astype(float)

In [31]:
top_spender[['Total Purchase Value']]=top_spender[['Total Purchase Value']].replace('[\$,]','',regex=True).astype(float)

top_spender['Average Purchase Price']=(top_spender['Total Purchase Value']/top_spender['Purchase Count']).map("${:.2f}".format)
top_spender.head()

              Purchase Count  Total Purchase Value Average Purchase Price
Adairialis76               1                  2.46                  $2.46
Aduephos78                 3                  6.70                  $2.23
Aeduera68                  3                  5.80                  $1.93
Aela49                     1                  2.46                  $2.46
Aela59                     1                  1.27                  $1.27

In [32]:
sort_top_spender=top_spender.sort_values(by='Total Purchase Value', ascending=False)
sort_top_spender.head()

             Purchase Count  Total Purchase Value Average Purchase Price
Undirrala66               5                 17.06                  $3.41
Saedue76                  4                 13.56                  $3.39
Mindimnya67               4                 12.74                  $3.19
Haellysu29                3                 12.73                  $4.24
Eoda93                    3                 11.58                  $3.86

In [33]:
total_purchase_value=group_by_gender["Price"].sum()
tpv=total_purchase_value.map("${:.2f}".format)
tpv

Gender
Female                    $382.91
Male                     $1867.68
Other / Non-Disclosed      $35.74
Name: Price, dtype: object

In [34]:
No_total=round((group_by_gender["Price"].sum())/(file_json_sort.groupby('Gender').SN.nunique()),2)
Nor_total=No_total.map("${:.2f}".format)
Nor_total

Gender
Female                   $3.83
Male                     $4.02
Other / Non-Disclosed    $4.47
dtype: object

In [35]:
purchase_table=pd.DataFrame({"Purchase Count":gender_count,
                              "Average Purchase Price":avg,
                              "Total Purchase Value":tpv,
                              "Normalized Totals":Nor_total})
purchase_table

,Average Purchase Price,Normalized Totals,Purchase Count,Total Purchase Value
Female,$2.82,$3.83,136,$382.91
Male,$2.95,$4.02,633,$1867.68
Other / Non-Disclosed,$3.25,$4.47,11,$35.74

In [36]:
avg_pur_price=file_json_sort.groupby(['Gender'])
avg_pur_price.mean()

                             Age     Item ID     Price
Gender
Female                 22.558824   88.110294  2.815515
Male                   22.685624   91.571880  2.950521
Other / Non-Disclosed  27.363636  114.636364  3.249091

In [37]:
gender_counts=file_json["Gender"].value_counts()
gender_counts

Male                     633
Female                   136
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [38]:
gd_group=file_json.groupby(['Gender'])
#print(gd_group)
gd_group.count()

                       Age  Item ID  Item Name  Price   SN
Gender
Female                 136      136        136    136  136
Male                   633      633        633    633  633
Other / Non-Disclosed   11       11         11     11   11

In [39]:
#group_item=file_json.groupby(['Item Name'])
#group_item.head()
#file_json_null=file_json.isnull().sum()
#file_json_null
#file_json.columns
#file_json["SN"].unique()
#sn_list.count
total_user=pd.DataFrame({"Total Players":[total_user_count]})
total_user

   Total Players
0            573

In [40]:
unit_id=file_json["Item ID"].unique()
unit_id_number=len(unit_id)
unit_id_number

183

In [41]:
avg_price=file_json["Price"].mean()
round(avg_price,2)

2.93

In [42]:
total_purchase=file_json["Price"].count()
total_purchase

780

In [43]:
total_revenue=file_json["Price"].sum()
total_revenue

2286.33

In [44]:
pur_chase_analyst=pd.DataFrame({"Number of Unique Items":[unit_id_number],
                                "Average Price":[round(avg_price,2)],
                                "Number of Purchase":[total_purchase],
                                "Total Revenue":"$"+str(total_revenue)})
pur_chase_analyst

   Average Price  Number of Purchase  Number of Unique Items Total Revenue
0           2.93                 780                     183      $2286.33